tylertms/dspic33e-sim/conformance/dci.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} DciConformance;

enum {
    DCI_CONTROL1 = 0x0280u,
    DCI_CONTROL2 = 0x0282u,
    DCI_CONTROL3 = 0x0284u,
    DCI_STATUS = 0x0286u,
    DCI_TRANSMIT_SLOTS = 0x0288u,
    DCI_RECEIVE_SLOTS = 0x028cu,
    DCI_RECEIVE_BASE = 0x0290u,
    DCI_TRANSMIT_BASE = 0x0298u,
    DCI_ENABLE = 0x8000u,
    DCI_STOP_IDLE = 0x2000u,
    DCI_LOOPBACK = 0x0800u,
    DCI_EXTERNAL_CLOCK = 0x0400u,
    DCI_EXTERNAL_FRAME = 0x0100u,
    DCI_UNDERFLOW_LAST = 0x0080u,
    DCI_TRISTATE = 0x0040u,
    DCI_DATA_JUSTIFY = 0x0020u,
    DCI_SAMPLE_RISING = 0x0200u,
    DCI_MODE_I2S = 0x0001u,
    DCI_MODE_AC_LINK_16 = 0x0002u,
    DCI_MODE_AC_LINK_20 = 0x0003u,
    DCI_RECEIVE_OVERFLOW = 0x0008u,
    DCI_RECEIVE_FULL = 0x0004u,
    DCI_TRANSMIT_UNDERFLOW = 0x0002u,
    DCI_TRANSMIT_EMPTY = 0x0001u,
    DCI_PMD = 0x0760u,
    DCI_PMD_MASK = 0x0100u,
    DCI_ERROR_IRQ = 59u,
    DCI_TRANSFER_IRQ = 60u,
    DCI_DMA_REQUEST = 0x3cu,
    DCI_VECTOR = 0x0200u,
    DCI_PPS_INPUTS = 0x06d0u,
    DCI_PPS_FRAME = 0x06d2u,
    DCI_PPS_DATA_OUTPUT = 0x0682u,
    DCI_PPS_CLOCK_FRAME_OUTPUT = 0x0684u,
    GPIO_TRIS_D = 0x0e30u,
    GPIO_ANALOG_D = 0x0e3eu,
    GPIO_PORT_D = 3u,
    GPIO_DATA_MASK = 0x0001u,
    GPIO_CLOCK_MASK = 0x0002u,
    GPIO_FRAME_MASK = 0x0004u,
    GPIO_ANALOG_CLOCK_MASK = 0x0040u,
    PPS_DATA_PIN = 64u,
    PPS_CLOCK_PIN = 65u,
    PPS_FRAME_PIN = 66u,
    PPS_DATA_OUTPUT_PIN = 67u,
    PPS_CLOCK_OUTPUT_PIN = 68u,
    PPS_FRAME_OUTPUT_PIN = 69u,
    PPS_ANALOG_CLOCK_PIN = 70u,
    OPCODE_SLEEP = 0xfe4000u,
    OPCODE_IDLE = 0xfe4001u
};

static void expect(DciConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[dci-failed] %s\n", name);
    }
}

static uint16_t configuration(uint8_t width, uint8_t slots, uint8_t buffers) {
    return (uint16_t)(((uint16_t)(buffers - 1u) << 10u) |
                      ((uint16_t)(slots - 1u) << 5u) | (width - 1u));
}

static bool clock_word(Dspic33* cpu, uint16_t value, bool frame_sync) {
    return dspic33_dci_clock(cpu, value, frame_sync, 0u) &&
           dspic33_device_advance(cpu, 0u);
}

static void configure_serial_pins(Dspic33* cpu) {
    dspic33_write_word(cpu, GPIO_ANALOG_D,
                       (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) & ~0x0007u));
    dspic33_write_word(cpu, GPIO_TRIS_D,
                       (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | 0x0007u));
    dspic33_write_word(cpu, DCI_PPS_INPUTS,
                       (uint16_t)((PPS_CLOCK_PIN << 8u) | PPS_DATA_PIN));
    dspic33_write_word(cpu, DCI_PPS_FRAME, PPS_FRAME_PIN);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, 0x0007u);
}

static bool drive_serial_edge(Dspic33* cpu, bool high, bool rising,
                              uint16_t clock_mask) {
    uint16_t data = high ? GPIO_DATA_MASK : 0u;
    uint16_t initial_clock = rising ? 0u : clock_mask;
    uint16_t sample_clock = rising ? clock_mask : 0u;
    return dspic33_gpio_drive(cpu, GPIO_PORT_D, data, GPIO_DATA_MASK) &&
           dspic33_gpio_drive(cpu, GPIO_PORT_D, initial_clock, clock_mask) &&
           dspic33_gpio_drive(cpu, GPIO_PORT_D, sample_clock, clock_mask);
}

static bool activate_serial_clock(Dspic33* cpu, bool rising, uint16_t clock_mask) {
    uint8_t edges = cpu->io.dci.serial_startup_bits;
    while (edges-- != 0u) {
        if (!drive_serial_edge(cpu, false, rising, clock_mask)) {
            return false;
        }
    }
    return true;
}

static bool prepare_serial_data(Dspic33* cpu, bool rising, uint16_t clock_mask) {
    uint16_t control;
    if (!activate_serial_clock(cpu, rising, clock_mask)) {
        return false;
    }
    control = dspic33_read_word(cpu, DCI_CONTROL1);
    if (cpu->io.dci.serial_delay ||
        (cpu->io.dci.pps_frame_pending && !cpu->io.dci.started &&
         (control & 0x0003u) < DCI_MODE_AC_LINK_16 &&
         (control & DCI_DATA_JUSTIFY) == 0u)) {
        return drive_serial_edge(cpu, false, rising, clock_mask);
    }
    return true;
}

static bool drive_serial_pin_bit(Dspic33* cpu, bool high, bool rising,
                                 uint16_t clock_mask) {
    return prepare_serial_data(cpu, rising, clock_mask) &&
           drive_serial_edge(cpu, high, rising, clock_mask);
}

static bool drive_mapped_serial_word(Dspic33* cpu, uint16_t value, uint8_t width,
                                     bool rising, uint16_t data_mask,
                                     uint16_t clock_mask) {
    uint8_t bit;
    if (!prepare_serial_data(cpu, rising, clock_mask)) {
        return false;
    }
    for (bit = 0u; bit < width; bit++) {
        uint16_t data =
            bit < 16u && (value & (uint16_t)(0x8000u >> bit)) != 0u ? data_mask : 0u;
        uint16_t initial_clock = rising ? 0u : clock_mask;
        uint16_t sample_clock = rising ? clock_mask : 0u;
        if (!dspic33_gpio_drive(cpu, GPIO_PORT_D, data, data_mask) ||
            !dspic33_gpio_drive(cpu, GPIO_PORT_D, initial_clock, clock_mask) ||
            !dspic33_gpio_drive(cpu, GPIO_PORT_D, sample_clock, clock_mask)) {
            return false;
        }
    }
    return true;
}

static bool drive_serial_pin_word(Dspic33* cpu, uint16_t value, uint8_t width,
                                  bool rising, uint16_t clock_mask) {
    uint8_t bit;
    for (bit = 0u; bit < width; bit++) {
        bool high = bit < 16u && (value & (uint16_t)(0x8000u >> bit)) != 0u;
        if (!drive_serial_pin_bit(cpu, high, rising, clock_mask)) {
            return false;
        }
    }
    return true;
}

static bool drive_serial_bit(Dspic33* cpu, bool high, bool rising) {
    return drive_serial_pin_bit(cpu, high, rising, GPIO_CLOCK_MASK);
}

static bool drive_serial_word(Dspic33* cpu, uint16_t value, uint8_t width,
                              bool rising) {
    return drive_serial_pin_word(cpu, value, width, rising, GPIO_CLOCK_MASK);
}

static uint16_t serial_word_mask(uint8_t width) {
    return width == 16u ? UINT16_MAX : (uint16_t)(UINT16_MAX << (16u - width));
}

static void configure_external(Dspic33* cpu, uint16_t control, uint8_t width,
                               uint8_t slots, uint8_t buffers, uint16_t transmit,
                               uint16_t receive) {
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(width, slots, buffers));
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, transmit);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, receive);
    dspic33_write_word(cpu, DCI_CONTROL1,
                       (uint16_t)(DCI_ENABLE | DCI_EXTERNAL_CLOCK | control));
}

