tylertms/dspic33e-sim/conformance/dci.c
static void configure_internal(Dspic33* cpu, uint16_t control, uint8_t width,
                               uint8_t slots, uint8_t buffers, uint16_t transmit,
                               uint16_t receive) {
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(width, slots, buffers));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, transmit);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, receive);
    dspic33_write_word(cpu, DCI_CONTROL1, (uint16_t)(DCI_ENABLE | control));
}

static bool drive_internal_pin_slot(Dspic33* cpu, uint16_t value, uint8_t width,
                                    uint64_t start_delay) {
    uint64_t bit_cycles =
        ((uint64_t)(dspic33_read_word(cpu, DCI_CONTROL3) & 0x0fffu) + 1u) * 2u;
    uint64_t sample_offset =
        (dspic33_read_word(cpu, DCI_CONTROL1) & DCI_SAMPLE_RISING) != 0u
            ? 0u
            : bit_cycles / 2u;
    uint8_t bit;
    for (bit = 0u; bit < width; bit++) {
        uint16_t high = bit < 16u && (value & (uint16_t)(0x8000u >> bit)) != 0u
                            ? GPIO_DATA_MASK
                            : 0u;
        if (!dspic33_gpio_drive(cpu, GPIO_PORT_D, high, GPIO_DATA_MASK) ||
            !dspic33_device_advance(cpu, bit == 0u ? start_delay + sample_offset
                                                   : bit_cycles)) {
            return false;
        }
    }
    return dspic33_device_advance(cpu, bit_cycles - sample_offset);
}

static uint16_t interrupt_word(uint8_t irq, uint16_t base) {
    return (uint16_t)(base + (irq / 16u) * 2u);
}

static uint16_t interrupt_mask(uint8_t irq) { return (uint16_t)(1u << (irq % 16u)); }

static bool interrupt_set(Dspic33* cpu, uint8_t irq) {
    return (dspic33_read_word(cpu, interrupt_word(irq, 0x0800u)) &
            interrupt_mask(irq)) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = interrupt_word(irq, 0x0800u);
    dspic33_write_word(
        cpu, address,
        (uint16_t)(dspic33_read_word(cpu, address) & ~interrupt_mask(irq)));
}

static void enable_interrupt(Dspic33* cpu, uint8_t irq, uint8_t priority) {
    uint16_t enable = interrupt_word(irq, 0x0820u);
    uint16_t ipc = (uint16_t)(0x0840u + (irq / 4u) * 2u);
    uint16_t shift = (uint16_t)((irq % 4u) * 4u);
    dspic33_write_word(
        cpu, enable, (uint16_t)(dspic33_read_word(cpu, enable) | interrupt_mask(irq)));
    dspic33_write_word(
        cpu, ipc,
        (uint16_t)((dspic33_read_word(cpu, ipc) & ~(uint16_t)(7u << shift)) |
                   (uint16_t)(priority << shift)));
    cpu->program[(0x0014u + irq * 2u) / 2u] = DCI_VECTOR;
}

static void configure_dma(Dspic33* cpu, uint8_t channel, uint16_t control,
                          uint32_t memory, uint16_t pad, uint16_t count,
                          uint8_t request) {
    uint16_t base = (uint16_t)(0x0b00u + channel * 0x10u);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)memory);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(memory >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0au), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), count);
    dspic33_write_word(cpu, base, (uint16_t)(control | 0x8000u));
}

static void access_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t index;
    dspic33_reset(cpu, 0u);
    for (index = 0u; index < 4u; index++) {
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(DCI_RECEIVE_BASE + index * 2u)) == 0u,
               "RXBUF deterministic POR value");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(DCI_TRANSMIT_BASE + index * 2u)) == 0u,
               "TXBUF reads zero at POR");
    }
    expect(state, dspic33_read_word(cpu, DCI_CONTROL1) == 0u, "DCICON1 reset");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL2) == 0u, "DCICON2 reset");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL3) == 0u, "DCICON3 reset");
    expect(state, dspic33_read_word(cpu, DCI_STATUS) == 0u, "DCISTAT reset");
    expect(state, dspic33_read_word(cpu, DCI_TRANSMIT_SLOTS) == 0u, "TSCON reset");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_SLOTS) == 0u, "RSCON reset");

    dspic33_write_word(cpu, DCI_CONTROL1, UINT16_MAX);
    dspic33_write_word(cpu, DCI_CONTROL2, UINT16_MAX);
    dspic33_write_word(cpu, DCI_CONTROL3, UINT16_MAX);
    dspic33_write_word(cpu, DCI_STATUS, UINT16_MAX);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, UINT16_MAX);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, UINT16_MAX);
    expect(state, dspic33_read_word(cpu, DCI_CONTROL1) == 0xafe3u,
           "DCICON1 access mask");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL2) == 0x0defu,
           "DCICON2 access mask");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL3) == 0x0fffu,
           "DCICON3 access mask");
    expect(state, dspic33_read_word(cpu, DCI_STATUS) == 0u, "DCISTAT is read only");
    expect(state, dspic33_read_word(cpu, DCI_TRANSMIT_SLOTS) == UINT16_MAX,
           "TSCON access mask");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_SLOTS) == UINT16_MAX,
           "RSCON access mask");
    for (index = 0u; index < 4u; index++) {
        uint16_t rx = (uint16_t)(DCI_RECEIVE_BASE + index * 2u);
        uint16_t tx = (uint16_t)(DCI_TRANSMIT_BASE + index * 2u);
        dspic33_write_word(cpu, rx, 0x55aau);
        dspic33_write_word(cpu, tx, (uint16_t)(0x1000u + index));
        expect(state, dspic33_read_word(cpu, rx) == 0u, "RXBUF rejects CPU write");
        expect(state, dspic33_read_word(cpu, tx) == 0u, "TXBUF is write only");
    }
}

static void width_and_lane_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t width;
    for (width = 4u; width <= 16u; width++) {
        Dspic33DciTransfer transfer;
        uint16_t mask =
            width == 16u ? UINT16_MAX : (uint16_t)(UINT16_MAX << (16u - width));
        uint16_t value = (uint16_t)(0xa55au & mask);
        dspic33_reset(cpu, 0u);
        configure_external(cpu, 0u, width, 1u, 1u, 1u, 1u);
        dspic33_write_word(cpu, DCI_TRANSMIT_BASE, value);
        expect(state, clock_word(cpu, 0x5aa5u, false), "clock width event");
        expect(state,
               dspic33_dci_transmit(cpu, &transfer) && transfer.value == value &&
                   transfer.slot == 0u && transfer.driven,
               "word width masks left-justified transmit data");
        expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == (0x5aa5u & mask),
               "word width masks left-justified receive data");
        expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_FULL) == 0u,
               "RXBUF word read clears RFUL");
    }

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0x7b6au, false), "clock byte-read fixture");
    expect(state, dspic33_read_byte(cpu, DCI_RECEIVE_BASE) == 0x6au,
           "RXBUF low-byte read returns low lane");
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_FULL) == 0u,
           "RXBUF byte read clears RFUL");
}

