tylertms/dspic33e-sim/conformance/dci.c
static void slot_buffer_status_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t index;
    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 4u, 4u, 0x000fu, 0x000fu);
    for (index = 0u; index < 4u; index++) {
        dspic33_write_word(cpu, (uint16_t)(DCI_TRANSMIT_BASE + index * 2u),
                           (uint16_t)(0x1000u + index));
    }
    for (index = 0u; index < 4u; index++) {
        expect(state, clock_word(cpu, (uint16_t)(0x2000u + index), false),
               "clock multibuffer word");
    }
    for (index = 0u; index < 4u; index++) {
        Dspic33DciTransfer transfer;
        expect(state,
               dspic33_dci_transmit(cpu, &transfer) &&
                   transfer.value == (uint16_t)(0x1000u + index) &&
                   transfer.slot == index,
               "shared pointer selects transmit buffer by slot");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(DCI_RECEIVE_BASE + index * 2u)) ==
                   (uint16_t)(0x2000u + index),
               "shared pointer selects receive buffer by slot");
    }
    expect(state,
           (dspic33_read_word(cpu, DCI_STATUS) &
            (DCI_RECEIVE_FULL | DCI_RECEIVE_OVERFLOW)) == 0u,
           "reading every RXBUF clears receive status");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state,
           clock_word(cpu, 0x1010u, false) &&
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_EMPTY) == 0u,
           "receive-only transfer leaves TMPTY clear");
    dspic33_read_word(cpu, DCI_RECEIVE_BASE);
    expect(state, clock_word(cpu, 0x1111u, false), "clock first unread block");
    expect(state, clock_word(cpu, 0x2222u, false), "clock overflowing block");
    expect(state,
           (dspic33_read_word(cpu, DCI_STATUS) &
            (DCI_RECEIVE_FULL | DCI_RECEIVE_OVERFLOW)) ==
               (DCI_RECEIVE_FULL | DCI_RECEIVE_OVERFLOW),
           "unread replacement sets RFUL and ROV");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2222u,
           "overflow keeps newest completed receive word");
    expect(state,
           (dspic33_read_word(cpu, DCI_STATUS) &
            (DCI_RECEIVE_FULL | DCI_RECEIVE_OVERFLOW)) == 0u,
           "culprit RXBUF read clears RFUL and ROV");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 2u, 4u, 0x0001u, 0x0003u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    expect(state, clock_word(cpu, 0x3000u, false),
           "mixed-slot startup loads active TXBUF0");
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 2u, 0x2222u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 6u, 0x4444u);
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_EMPTY) != 0u,
           "inactive TXBUF writes do not suppress TMPTY");
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_EMPTY) == 0u,
           "active TXBUF0 write clears TMPTY");
    expect(state,
           clock_word(cpu, 0x3001u, false) && clock_word(cpu, 0x3002u, false) &&
               clock_word(cpu, 0x3003u, false),
           "mixed-slot pointer reaches TXBUF2");
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_UNDERFLOW) != 0u,
           "mixed-slot pointer detects unwritten active TXBUF2");
    expect(state, (cpu->io.dci.transmit_underflow & 0x0au) == 0u,
           "inactive TXBUF1 and TXBUF3 never underflow");
}

static void admission_and_clock_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t width;
    for (width = 1u; width < 4u; width++) {
        Dspic33DciTransfer transfer;
        dspic33_reset(cpu, 0u);
        configure_external(cpu, 0u, width, 1u, 1u, 1u, 1u);
        expect(state, clock_word(cpu, 0x1234u, true), "clock invalid word width");
        expect(state,
               !dspic33_dci_transmit(cpu, &transfer) &&
                   dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
               "invalid word width produces no DCI behavior");
    }

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_EXTERNAL_FRAME, 16u, 2u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0x1111u, false), "external frame waits without FS");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "external frame ignores CSCK before FS");
    expect(state, clock_word(cpu, 0x2222u, true), "external frame starts on FS");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2222u,
           "external frame captures synchronized first slot");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_EXTERNAL_FRAME, 16u, 2u, 1u, 0u, 0x0003u);
    expect(state, clock_word(cpu, 0x1234u, true), "start two-slot external frame");
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & 0x0f00u) == 0x0100u,
           "SLOT reports second slot after first frame word");
    expect(state, clock_word(cpu, 0x5678u, true), "clock spurious FS during frame");
    expect(state,
           (dspic33_read_word(cpu, DCI_STATUS) & 0x0f00u) == 0u &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5678u,
           "active frame ignores FS restart and completes slot one");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    expect(state, dspic33_device_advance(cpu, 1u), "apply DCI PMD disable");
    expect(state, clock_word(cpu, 0x3333u, false),
           "clock external DCI while PMD is effective");
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state, dspic33_device_advance(cpu, 1u), "apply DCI PMD enable");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "PMD-blocked clock leaves no receive word after re-enable");
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_write_word(cpu, DCI_CONTROL1,
                       DCI_ENABLE | DCI_EXTERNAL_CLOCK | DCI_STOP_IDLE);
    expect(state,
           clock_word(cpu, 0x4444u, false) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "DCISIDL stops external DCI in Idle");
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_EXTERNAL_CLOCK);
    expect(state,
           clock_word(cpu, 0x5555u, false) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5555u,
           "external DCI continues in Idle when DCISIDL is clear");
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           clock_word(cpu, 0x6666u, false) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x6666u,
           "external DCI continues in Sleep");
    cpu->power_state = DSPIC33_POWER_ACTIVE;

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state,
           clock_word(cpu, 0xb000u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "COFSD output ignores external frame-sync input");
    expect(state,
           dspic33_device_advance(cpu, 64u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "BCG zero disables internal DCI clock");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_EXTERNAL_CLOCK);
    expect(state,
           clock_word(cpu, 0x9090u, false) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "external DCI rejects nonzero BCG");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state,
           dspic33_device_advance(cpu, 11u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "internal clock waits three CSCK startup cycles");
    expect(state, dspic33_device_advance(cpu, 1u), "internal startup completes");
    dspic33_dci_input(cpu, 0xa000u);
    expect(state,
           dspic33_device_advance(cpu, 15u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "internal four-bit word waits two shifts per bit");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "internal four-bit word completes after sixteen cycles");

