tylertms/dspic33e-sim/conformance/dci.c
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    dspic33_dci_input(cpu, 0x5000u);
    expect(state,
           dspic33_device_advance(cpu, 32u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "BCG zero freezes a running internal DCI clock");
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    expect(state,
           dspic33_device_advance(cpu, 16u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5000u,
           "restored BCG resumes internal DCI clock");

    dspic33_dci_input(cpu, 0x6000u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_device_advance(cpu, 32u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5000u,
           "Sleep stops internal DCI clock");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state,
           dspic33_device_advance(cpu, 16u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x6000u,
           "internal DCI clock resumes after Sleep");
}

static void protocol_geometry_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t mode;
    for (mode = 0u; mode < 4u; mode++) {
        uint8_t width;
        for (width = 4u; width <= 16u; width++) {
            uint8_t frames;
            for (frames = 1u; frames <= 16u; frames++) {
                uint8_t options;
                for (options = 0u; options < 4u; options++) {
                    Dspic33DciTransfer transfer;
                    uint16_t control = mode;
                    uint16_t expected_mask = UINT16_MAX;
                    uint8_t expected_frames = frames;
                    uint16_t transmit = (uint16_t)(0xa55au + frames + width);
                    uint16_t receive = (uint16_t)(0x5aa5u + frames + width);
                    if ((options & 1u) != 0u) {
                        control |= DCI_DATA_JUSTIFY;
                    }
                    if ((options & 2u) != 0u) {
                        control |= DCI_SAMPLE_RISING;
                    }
                    if (mode < DCI_MODE_AC_LINK_16 && width < 16u) {
                        expected_mask = (uint16_t)(UINT16_MAX << (16u - width));
                    }
                    if (mode == DCI_MODE_AC_LINK_16) {
                        expected_frames = 13u;
                    } else if (mode == DCI_MODE_AC_LINK_20) {
                        expected_frames = 16u;
                    }
                    dspic33_reset(cpu, 0u);
                    configure_external(cpu, control, width, frames, 1u, 1u, 1u);
                    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, transmit);
                    expect(state, clock_word(cpu, receive, false),
                           "clock protocol geometry word");
                    expect(state,
                           dspic33_dci_transmit(cpu, &transfer) &&
                               transfer.slot == 0u &&
                               transfer.value == (transmit & expected_mask) &&
                               transfer.driven,
                           "protocol selects effective transmit geometry");
                    expect(state,
                           dspic33_read_word(cpu, DCI_RECEIVE_BASE) ==
                               (receive & expected_mask),
                           "protocol selects effective receive geometry");
                    expect(state, cpu->io.dci.slot == (expected_frames == 1u ? 0u : 1u),
                           "protocol selects effective frame geometry");
                }
            }
        }
    }
}

static void protocol_frame_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t justification;
    for (justification = 0u; justification < 2u; justification++) {
        uint16_t control = (uint16_t)(DCI_MODE_I2S | DCI_EXTERNAL_FRAME |
                                      (justification != 0u ? DCI_DATA_JUSTIFY : 0u));
        dspic33_reset(cpu, 0u);
        configure_external(cpu, control, 8u, 2u, 2u, 0u, 3u);
        expect(state, clock_word(cpu, 0x1100u, false),
               "I2S slave waits for frame edge");
        expect(state, cpu->io.dci.receive_buffered == 0u && !cpu->io.dci.started,
               "I2S absent frame edge leaves transfer idle");
        expect(state, clock_word(cpu, 0x2200u, true),
               "I2S frame edge starts half-frame");
        expect(state, cpu->io.dci.receive_buffered == 1u && cpu->io.dci.slot == 1u,
               "I2S frame edge transfers first logical word");
        expect(state, clock_word(cpu, 0x3300u, false),
               "I2S half-frame transfers remaining logical word");
        expect(state,
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2200u &&
                   dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x3300u &&
                   !cpu->io.dci.started,
               "I2S half-frame completes at programmed boundary");
        expect(state, clock_word(cpu, 0x4400u, false),
               "I2S waits for next frame edge after boundary");
        expect(state, cpu->io.dci.receive_buffered == 0u,
               "I2S idle edge gap transfers no word");
    }
}

static void ac_link_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33DciTransfer transfer;
    uint8_t slot;
    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_MODE_AC_LINK_16, 4u, 1u, 2u, 0x3001u, 0x3001u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 2u, 0xccccu);
    for (slot = 0u; slot < 13u; slot++) {
        expect(state, clock_word(cpu, (uint16_t)(0x2000u + slot), false),
               "clock 16-bit AC-Link slot");
        expect(state,
               dspic33_dci_transmit(cpu, &transfer) && transfer.slot == slot &&
                   transfer.driven,
               "16-bit AC-Link reports fixed slot position");
    }
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2000u &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x200cu,
           "16-bit AC-Link buffers tag and slot twelve");
    expect(state, cpu->io.dci.slot == 0u, "16-bit AC-Link wraps after thirteen slots");
    expect(state, (cpu->io.dci.receive_buffered | cpu->io.dci.transmit_buffered) == 0u,
           "16-bit AC-Link ignores slot thirteen enables");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_MODE_AC_LINK_20, 4u, 1u, 2u, 0x8001u, 0x8001u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1234u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 2u, 0xabcdu);
    for (slot = 0u; slot < 16u; slot++) {
        expect(state, clock_word(cpu, (uint16_t)(0x4000u + slot), false),
               "clock 20-bit AC-Link packed slot");
        expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.slot == slot,
               "20-bit AC-Link reports packed slot position");
    }
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x4000u &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x400fu,
           "20-bit AC-Link buffers first and final packed slots");
    expect(state, cpu->io.dci.slot == 0u,
           "20-bit AC-Link wraps after sixteen packed slots");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 2u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 3u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 3u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 2u, 0x2222u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_MODE_AC_LINK_16);
    expect(state, dspic33_device_advance(cpu, 75u) && cpu->io.dci.output.count == 0u,
           "16-bit AC-Link waits through tag-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 0u,
           "16-bit AC-Link completes sixteen-clock tag slot");
    expect(state, dspic33_device_advance(cpu, 79u) && cpu->io.dci.output.count == 0u,
           "16-bit AC-Link waits through data-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 1u,
           "16-bit AC-Link completes twenty-clock data slot");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 2u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 3u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_MODE_AC_LINK_20);
    expect(state, dspic33_device_advance(cpu, 75u) && cpu->io.dci.output.count == 0u,
           "20-bit AC-Link waits through first packed-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 0u,
           "20-bit AC-Link completes first sixteen-clock packed slot");
    expect(state, dspic33_device_advance(cpu, 63u) && cpu->io.dci.output.count == 0u,
           "20-bit AC-Link waits through second packed-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 1u,
           "20-bit AC-Link keeps sixteen-clock packed-slot timing");
}

static void protocol_integration_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t mode;
    for (mode = 0u; mode < 4u; mode++) {
        uint16_t expected = mode >= DCI_MODE_AC_LINK_16 ? 0x5aa5u : 0x5a00u;
        dspic33_reset(cpu, 0u);
        configure_external(cpu, (uint16_t)(mode | DCI_EXTERNAL_FRAME), 8u, 2u, 1u, 0u,
                           1u);
        expect(state, clock_word(cpu, 0x1100u, false),
               "protocol slave clocks without frame indication");
        expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
               "protocol slave remains idle before frame indication");
        expect(state, clock_word(cpu, 0x2200u, true),
               "protocol slave accepts frame indication");
        expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2200u,
               "protocol slave captures synchronized word");

        dspic33_reset(cpu, 0u);
        configure_dma(cpu, 0u, 0x0001u, (uint32_t)(0x4400u + mode * 2u),
                      DCI_RECEIVE_BASE, 0u, DCI_DMA_REQUEST);
        configure_external(cpu, mode, 8u, 1u, 1u, 0u, 1u);
        expect(state, clock_word(cpu, 0x5aa5u, false),
               "protocol raises receive DMA request");
        expect(state, dspic33_device_advance(cpu, 2u),
               "protocol completes receive DMA transfer");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(0x4400u + mode * 2u)) == expected,
               "protocol DMA observes effective word geometry");
    }

    for (mode = DCI_MODE_AC_LINK_16; mode <= DCI_MODE_AC_LINK_20; mode++) {
        uint8_t width;
        for (width = 1u; width < 4u; width++) {
            dspic33_reset(cpu, 0u);
            configure_external(cpu, mode, width, 1u, 1u, 0u, 1u);
            expect(state,
                   clock_word(cpu, 0xa55au, false) &&
                       dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa55au,
                   "AC-Link ignores programmed word-size field");
        }
    }
}

static void pps_serial_input_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33DciTransfer transfer;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, GPIO_ANALOG_D,
                       (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) & ~0x0003u));
    dspic33_write_word(cpu, GPIO_TRIS_D,
                       (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | 0x0003u));
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, 0x0003u);
    configure_external(cpu, DCI_SAMPLE_RISING, 8u, 1u, 1u, 1u, 1u);
    expect(state, drive_serial_word(cpu, 0xa500u, 8u, true),
           "clock default DCI VSS selection");
    expect(state,
           !cpu->io.dci.initialized && dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u &&
               !dspic33_dci_transmit(cpu, &transfer),
           "default DCI VSS selection produces no serial transfer");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_INPUTS, 0x0101u);
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state, drive_serial_word(cpu, 0xf000u, 4u, true),
           "clock unavailable virtual DCI selections");
    expect(state, !cpu->io.dci.initialized,
           "silicon erratum suppresses virtual DCI pin remapping");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 8u, 1u, 1u, 1u, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x5a00u);
    expect(state, drive_serial_word(cpu, 0xa500u, 8u, true),
           "clock PPS DCI on rising edges");
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa500u &&
               dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x5a00u &&
               transfer.slot == 0u && interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "PPS DCI shifts rising-edge data MSb first");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_dma(cpu, 0u, 0x0001u, 0x4400u, DCI_RECEIVE_BASE, 0u, DCI_DMA_REQUEST);
    configure_external(cpu, DCI_SAMPLE_RISING, 16u, 1u, 1u, 0u, 1u);
    expect(state, drive_serial_word(cpu, 0x6b4bu, 16u, true),
           "clock PPS DCI receive DMA block");
    expect(state,
           dspic33_device_advance(cpu, 2u) &&
               dspic33_read_word(cpu, 0x4400u) == 0x6b4bu,
           "PPS DCI receive block requests DMA");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_LOOPBACK, 8u, 1u, 1u, 1u, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x5a00u);
    expect(state, drive_serial_word(cpu, 0xa500u, 8u, true),
           "clock PPS DCI loopback word");
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5a00u &&
               dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x5a00u,
           "PPS DCI loopback replaces sampled pin data");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 1u, 0u);
    expect(state,
           drive_serial_bit(cpu, false, true) && interrupt_set(cpu, DCI_ERROR_IRQ),
           "PPS DCI transmit underflow raises error interrupt");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, 0u, 8u, 1u, 1u, 0u, 1u);
    expect(state, drive_serial_word(cpu, 0x3c00u, 8u, false),
           "clock PPS DCI on falling edges");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x3c00u,
           "PPS DCI honors falling-edge sample selection");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state,
           drive_serial_bit(cpu, true, true) && drive_serial_bit(cpu, false, true) &&
               cpu->io.dci.serial_bits == 2u,
           "PPS DCI captures partial word before remap");
    dspic33_write_word(cpu, DCI_PPS_INPUTS,
                       (uint16_t)((PPS_FRAME_PIN << 8u) | PPS_DATA_PIN));
    expect(state, drive_serial_bit(cpu, true, true) && cpu->io.dci.serial_bits == 2u,
           "old CSCK pin stops driving after remap");
    expect(state,
           drive_serial_pin_bit(cpu, false, true, GPIO_FRAME_MASK) &&
               drive_serial_pin_bit(cpu, true, true, GPIO_FRAME_MASK) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x9000u,
           "new CSCK pin completes retained partial word");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_INPUTS,
                       (uint16_t)((PPS_ANALOG_CLOCK_PIN << 8u) | PPS_DATA_PIN));
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | GPIO_ANALOG_CLOCK_MASK));
    dspic33_write_word(
        cpu, GPIO_ANALOG_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) | GPIO_ANALOG_CLOCK_MASK));
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state, drive_serial_pin_word(cpu, 0xf000u, 4u, true, GPIO_ANALOG_CLOCK_MASK),
           "drive analog-selected DCI clock pin");
    expect(state, !cpu->io.dci.initialized,
           "analog-selected DCI clock pin is suppressed");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_ANALOG_CLOCK_MASK);
    dspic33_write_word(
        cpu, GPIO_ANALOG_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) & ~GPIO_ANALOG_CLOCK_MASK));
    expect(state,
           drive_serial_pin_word(cpu, 0x9000u, 4u, true, GPIO_ANALOG_CLOCK_MASK) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x9000u,
           "digital DCI clock pin resumes serial transfer");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) & ~GPIO_CLOCK_MASK));
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state, drive_serial_word(cpu, 0xf000u, 4u, true),
           "drive output-configured DCI clock pin");
    expect(state, !cpu->io.dci.initialized,
           "output-configured DCI clock pin is suppressed");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | GPIO_CLOCK_MASK));
    expect(state,
           drive_serial_word(cpu, 0x6000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x6000u,
           "input-configured DCI clock pin resumes serial transfer");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_MODE_AC_LINK_16 | DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u,
                       1u);
    expect(state, drive_serial_word(cpu, 0xa55au, 20u, true),
           "clock PPS 16-bit AC-Link tag slot");
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa55au &&
               cpu->io.dci.slot == 1u,
           "PPS 16-bit AC-Link captures sixteen data and four padding clocks");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_MODE_AC_LINK_20 | DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u,
                       1u);
    expect(state, drive_serial_word(cpu, 0x5aa5u, 16u, true),
           "clock PPS 20-bit AC-Link packed slot");
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5aa5u &&
               cpu->io.dci.slot == 1u,
           "PPS 20-bit AC-Link captures packed sixteen-clock slot");
}

static void pps_qualification_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_INPUTS,
                       (uint16_t)((PPS_CLOCK_PIN << 8u) | PPS_ANALOG_CLOCK_PIN));
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | GPIO_ANALOG_CLOCK_MASK));
    dspic33_write_word(
        cpu, GPIO_ANALOG_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) | GPIO_ANALOG_CLOCK_MASK));
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state,
           drive_mapped_serial_word(cpu, 0xf000u, 4u, true, GPIO_ANALOG_CLOCK_MASK,
                                    GPIO_CLOCK_MASK) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "analog CSDI selection samples low");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    dspic33_write_word(
        cpu, GPIO_ANALOG_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) & ~GPIO_ANALOG_CLOCK_MASK));
    expect(state,
           drive_mapped_serial_word(cpu, 0xf000u, 4u, true, GPIO_ANALOG_CLOCK_MASK,
                                    GPIO_CLOCK_MASK) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xf000u,
           "digital CSDI selection resumes sampling");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) & ~GPIO_DATA_MASK));
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "output-configured CSDI selection samples low");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | GPIO_DATA_MASK));
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xf000u,
           "input-configured CSDI selection resumes sampling");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_FRAME, PPS_ANALOG_CLOCK_PIN);
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | GPIO_ANALOG_CLOCK_MASK));
    dspic33_write_word(
        cpu, GPIO_ANALOG_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) | GPIO_ANALOG_CLOCK_MASK));
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME | DCI_DATA_JUSTIFY,
                       4u, 1u, 1u, 0u, 1u);
    activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_ANALOG_CLOCK_MASK,
                       GPIO_ANALOG_CLOCK_MASK);
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) && cpu->io.dci.initialized &&
               !cpu->io.dci.started && dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "analog COFS selection cannot start a frame");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    dspic33_write_word(
        cpu, GPIO_ANALOG_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_ANALOG_D) & ~GPIO_ANALOG_CLOCK_MASK));
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xf000u,
           "digital COFS selection starts a frame");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) & ~GPIO_FRAME_MASK));
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME | DCI_DATA_JUSTIFY,
                       4u, 1u, 1u, 0u, 1u);
    activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK);
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) && cpu->io.dci.initialized &&
               !cpu->io.dci.started && dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "output-configured COFS selection cannot start a frame");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    dspic33_write_word(
        cpu, GPIO_TRIS_D,
        (uint16_t)(dspic33_read_word(cpu, GPIO_TRIS_D) | GPIO_FRAME_MASK));
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xf000u,
           "input-configured COFS selection starts a frame");
}

