tylertms/dspic33e-sim/conformance/dci.c
static void pps_frame_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME, 4u, 1u, 1u, 0u, 1u);
    activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK);
    expect(state, drive_serial_edge(cpu, true, true, GPIO_CLOCK_MASK),
           "sample default-justified DCI frame pulse");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_FRAME_MASK);
    expect(state,
           drive_serial_word(cpu, 0xa000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "default DJST begins data one serial clock after frame");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME | DCI_DATA_JUSTIFY,
                       4u, 1u, 1u, 0u, 1u);
    activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK | GPIO_DATA_MASK,
                       GPIO_FRAME_MASK | GPIO_DATA_MASK);
    expect(state, drive_serial_bit(cpu, true, true),
           "sample same-cycle-justified DCI frame pulse");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_FRAME_MASK);
    expect(state,
           drive_serial_bit(cpu, false, true) && drive_serial_bit(cpu, true, true) &&
               drive_serial_bit(cpu, false, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "DJST begins data during frame serial clock");
    expect(state, drive_serial_word(cpu, 0xf000u, 4u, true),
           "clock falling multi-channel frame transition");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "multi-channel mode ignores falling frame transition");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(
        cpu, DCI_MODE_I2S | DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME | DCI_DATA_JUSTIFY,
        4u, 1u, 1u, 0u, 1u);
    activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK | GPIO_DATA_MASK,
                       GPIO_FRAME_MASK | GPIO_DATA_MASK);
    expect(state,
           drive_serial_word(cpu, 0x8000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x8000u,
           "I2S rising frame edge starts serial word");
    dspic33_read_word(cpu, DCI_RECEIVE_BASE);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_FRAME_MASK | GPIO_DATA_MASK);
    expect(state,
           drive_serial_word(cpu, 0x5000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5000u,
           "I2S falling frame edge starts serial word");
}

static void pps_serial_matrix_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t mode;
    for (mode = 0u; mode < 2u; mode++) {
        uint8_t width;
        for (width = 4u; width <= 16u; width++) {
            uint8_t rising;
            for (rising = 0u; rising < 2u; rising++) {
                uint8_t immediate;
                for (immediate = 0u; immediate < 2u; immediate++) {
                    uint16_t value = (uint16_t)(0xa55au & serial_word_mask(width));
                    uint16_t control = DCI_EXTERNAL_FRAME;
                    if (mode != 0u) {
                        control |= DCI_MODE_I2S;
                    }
                    if (rising != 0u) {
                        control |= DCI_SAMPLE_RISING;
                    }
                    if (immediate != 0u) {
                        control |= DCI_DATA_JUSTIFY;
                    }
                    dspic33_reset(cpu, 0u);
                    configure_serial_pins(cpu);
                    configure_external(cpu, control, width, 1u, 1u, 0u, 1u);
                    activate_serial_clock(cpu, rising != 0u, GPIO_CLOCK_MASK);
                    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK,
                                       GPIO_FRAME_MASK);
                    if (immediate == 0u) {
                        expect(state,
                               drive_serial_edge(cpu, false, rising != 0u,
                                                 GPIO_CLOCK_MASK),
                               "clock default-justified PPS matrix frame");
                        if (mode == 0u) {
                            dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_FRAME_MASK);
                        }
                    }
                    expect(state,
                           drive_serial_word(cpu, value, width, rising != 0u) &&
                               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == value &&
                               !cpu->io.dci.started,
                           "PPS serial matrix captures framed word");
                }
            }
        }
    }
}

static void pps_startup_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0xa000u);
    dspic33_write_word(cpu, DCI_CONTROL1,
                       DCI_ENABLE | DCI_EXTERNAL_CLOCK | DCI_SAMPLE_RISING |
                           DCI_DATA_JUSTIFY);
    expect(state,
           cpu->io.dci.serial_startup_bits == 3u && !cpu->io.dci.initialized &&
               !interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "external DCI waits for three startup clocks");
    expect(state,
           drive_serial_edge(cpu, false, true, GPIO_CLOCK_MASK) &&
               cpu->io.dci.serial_startup_bits == 2u && !cpu->io.dci.initialized &&
               !interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "first startup clock leaves DCI buffers unavailable");
    expect(state,
           drive_serial_edge(cpu, false, true, GPIO_CLOCK_MASK) &&
               cpu->io.dci.serial_startup_bits == 1u && !cpu->io.dci.initialized &&
               !interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "second startup clock leaves DCI buffers unavailable");
    expect(state,
           drive_serial_edge(cpu, false, true, GPIO_CLOCK_MASK) &&
               cpu->io.dci.serial_startup_bits == 0u && cpu->io.dci.initialized &&
               cpu->io.dci.started && interrupt_set(cpu, DCI_TRANSFER_IRQ) &&
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_EMPTY) != 0u,
           "third startup clock transfers buffers and raises DCI interrupt");
}

static void pps_internal_input_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t mode;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_INPUTS, 0u);
    dspic33_dci_input(cpu, UINT16_MAX);
    configure_internal(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state,
           drive_internal_pin_slot(cpu, UINT16_MAX, 4u, 12u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "internal DCI VSS selection ignores logical input latch");

    for (mode = DCI_MODE_I2S - 1u; mode <= DCI_MODE_I2S; mode++) {
        uint8_t width;
        for (width = 4u; width <= 16u; width++) {
            uint8_t rising;
            for (rising = 0u; rising < 2u; rising++) {
                uint16_t value = (uint16_t)(0xa55au & serial_word_mask(width));
                uint16_t control = mode;
                if (rising != 0u) {
                    control |= DCI_SAMPLE_RISING;
                }
                dspic33_reset(cpu, 0u);
                configure_serial_pins(cpu);
                configure_internal(cpu, control, width, 1u, 1u, 0u, 1u);
                expect(state,
                       drive_internal_pin_slot(cpu, value, width, 12u) &&
                           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == value,
                       "internally clocked DCI samples mapped CSDI pin");
            }
        }
    }

    for (mode = DCI_MODE_AC_LINK_16; mode <= DCI_MODE_AC_LINK_20; mode++) {
        uint8_t rising;
        for (rising = 0u; rising < 2u; rising++) {
            uint16_t control = mode;
            if (rising != 0u) {
                control |= DCI_SAMPLE_RISING;
            }
            dspic33_reset(cpu, 0u);
            configure_serial_pins(cpu);
            configure_internal(cpu, control, 4u, 1u, 1u, 0u, 1u);
            expect(state,
                   drive_internal_pin_slot(cpu, 0x5aa5u, 16u, 12u) &&
                       dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5aa5u,
                   "internally clocked AC-Link samples mapped CSDI pin");
        }
    }
}

static void pps_internal_frame_cases(DciConformance* state, Dspic33* cpu) {
    bool high;
    uint8_t mode;
    for (mode = 0u; mode < 4u; mode++) {
        uint8_t rising;
        for (rising = 0u; rising < 2u; rising++) {
            uint8_t immediate;
            for (immediate = 0u; immediate < 2u; immediate++) {
                uint16_t control = (uint16_t)(mode | DCI_EXTERNAL_FRAME);
                uint16_t value = mode >= DCI_MODE_AC_LINK_16 ? 0x5aa5u : 0xa000u;
                uint8_t width = mode == DCI_MODE_AC_LINK_16   ? 16u
                                : mode == DCI_MODE_AC_LINK_20 ? 16u
                                                              : 4u;
                uint64_t delay;
                if (rising != 0u) {
                    control |= DCI_SAMPLE_RISING;
                }
                if (immediate != 0u) {
                    control |= DCI_DATA_JUSTIFY;
                }
                delay = mode < DCI_MODE_AC_LINK_16 && immediate != 0u ? 0u : 4u;
                dspic33_reset(cpu, 0u);
                configure_serial_pins(cpu);
                configure_internal(cpu, control, 4u, 1u, 1u, 0u, 1u);
                expect(state,
                       dspic33_device_advance(cpu, 12u) && cpu->io.dci.initialized &&
                           !cpu->io.dci.started,
                       "internal CSCK waits for mapped COFS edge");
                dspic33_gpio_drive(cpu, GPIO_PORT_D,
                                   GPIO_FRAME_MASK |
                                       ((value & 0x8000u) != 0u ? GPIO_DATA_MASK : 0u),
                                   GPIO_FRAME_MASK | GPIO_DATA_MASK);
                expect(state,
                       drive_internal_pin_slot(cpu, value, width, delay) &&
                           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == value,
                       "mapped COFS starts internally clocked DCI frame");
            }
        }
    }

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x000cu);
    configure_internal(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME, 4u, 1u, 1u, 0u, 1u);
    expect(state,
           dspic33_device_advance(cpu, 14u) && !cpu->io.dci.started &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && !high,
           "internal CSCK remains active while waiting for external COFS");
}

static void pps_external_frame_output_cases(DciConformance* state, Dspic33* cpu) {
    bool high;
    uint8_t immediate;
    for (immediate = 0u; immediate < 2u; immediate++) {
        uint16_t justify = immediate != 0u ? DCI_DATA_JUSTIFY : 0u;
        dspic33_reset(cpu, 0u);
        configure_serial_pins(cpu);
        dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d00u);
        configure_external(cpu, (uint16_t)(DCI_SAMPLE_RISING | justify), 4u, 1u, 1u, 0u,
                           0u);
        activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
        expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
               "external CSCK multi-channel master asserts COFS");
        expect(state,
               drive_serial_edge(cpu, false, true, GPIO_CLOCK_MASK) &&
                   dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
               "external CSCK multi-channel master emits one-clock COFS");

        dspic33_reset(cpu, 0u);
        configure_serial_pins(cpu);
        dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d00u);
        configure_external(cpu, (uint16_t)(DCI_MODE_I2S | DCI_SAMPLE_RISING | justify),
                           4u, 1u, 1u, 0u, 0u);
        activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
        expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
               "external CSCK I2S master starts with right-channel COFS");
        if (immediate == 0u) {
            drive_serial_edge(cpu, false, true, GPIO_CLOCK_MASK);
        }
        expect(state,
               drive_serial_word(cpu, 0u, 4u, true) &&
                   dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
               "external CSCK I2S master toggles COFS at half-frame boundary");
    }

    {
        uint8_t mode;
        for (mode = DCI_MODE_AC_LINK_16; mode <= DCI_MODE_AC_LINK_20; mode++) {
            for (immediate = 0u; immediate < 2u; immediate++) {
                uint16_t control =
                    (uint16_t)(mode | DCI_SAMPLE_RISING |
                               (immediate != 0u ? DCI_DATA_JUSTIFY : 0u));
                dspic33_reset(cpu, 0u);
                configure_serial_pins(cpu);
                dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d00u);
                configure_external(cpu, control, 4u, 1u, 1u, 0u, 0u);
                activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
                expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
                       "external CSCK AC-Link master asserts tag COFS");
                expect(state,
                       drive_serial_word(cpu, 0u, 16u, true) &&
                           dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
                       "AC-Link master negates COFS after sixteen clocks");
                expect(
                    state,
                    drive_serial_word(cpu, 0u, 240u, true) &&
                        dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
                    "AC-Link master starts next 256-clock frame independent of DJST");
            }
        }
    }
}

