tylertms/dspic33e-sim/conformance/dci.c
static void pps_internal_frame_output_cases(DciConformance* state, Dspic33* cpu) {
    bool high;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d00u);
    configure_internal(cpu, DCI_MODE_I2S, 4u, 1u, 1u, 0u, 0u);
    expect(state,
           dspic33_device_advance(cpu, 7u) &&
               dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
           "default I2S COFS remains low before final startup clock");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
           "default I2S COFS rises one clock before right-channel data");
    expect(state,
           dspic33_device_advance(cpu, 4u) &&
               dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
           "default I2S COFS has no extra transition at data boundary");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d00u);
    configure_internal(cpu, DCI_MODE_AC_LINK_16, 4u, 1u, 1u, 0u, 0u);
    expect(state,
           dspic33_device_advance(cpu, 8u) &&
               dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
           "internal AC-Link COFS asserts for tag interval");
    expect(state,
           dspic33_device_advance(cpu, 63u) &&
               dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
           "internal AC-Link COFS remains high through fifteen data clocks");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
           "internal AC-Link COFS negates after sixteen clocks");
}

static void pps_bcg_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool high;
    bool copy_high;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x000cu);
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    expect(state,
           dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && high &&
               (dspic33_read_word(cpu, DCI_CONTROL1) & DCI_ENABLE) == 0u,
           "nonzero BCG drives CSCK while DCI is disabled");
    expect(state,
           dspic33_device_advance(cpu, 2u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && !high,
           "standalone BCG reaches falling half-cycle");
    expect(state,
           dspic33_device_advance(cpu, 2u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && high,
           "standalone BCG completes full cycle");
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_device_power_state_changed(cpu);
    expect(state,
           dspic33_device_advance(cpu, 9u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && high,
           "Sleep retains standalone BCG phase");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    dspic33_device_power_state_changed(cpu);
    expect(state,
           dspic33_device_advance(cpu, 2u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && !high,
           "wake resumes standalone BCG phase");
    expect(state, dspic33_initialize(&copy), "initialize standalone BCG copy");
    expect(state,
           dspic33_copy(&copy, cpu) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) &&
               dspic33_dci_pin(&copy, PPS_CLOCK_OUTPUT_PIN, &copy_high) &&
               high == copy_high,
           "copy preserves standalone BCG phase");
    dspic33_destroy(&copy);
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               !dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high),
           "PMD releases standalone BCG output");
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high),
           "PMD clear restores standalone BCG output");

    dspic33_write_word(cpu, DCI_CONTROL1, DCI_STOP_IDLE);
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_device_power_state_changed(cpu);
    expect(state,
           dspic33_device_advance(cpu, 7u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high),
           "DCISIDL retains standalone BCG phase in Idle");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    dspic33_device_power_state_changed(cpu);
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && high,
           "Idle wake resumes standalone BCG phase");

    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               !dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) &&
               dspic33_read_word(cpu, DCI_CONTROL3) == 0u,
           "warm reset clears standalone BCG output");
}

static void pps_internal_sample_lifecycle_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    uint8_t bit;
    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_internal(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_DATA_MASK, GPIO_DATA_MASK);
    expect(state,
           dspic33_device_advance(cpu, 12u) && cpu->io.dci.serial_bits == 1u &&
               cpu->events.count == 2u,
           "internal CSDI sampler retains independent bit and word events");
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.dci.pmd_disabled &&
               cpu->events.count == 2u && cpu->events.items[0].paused &&
               cpu->events.items[1].paused,
           "PMD pauses internal CSDI sample and completion events");
    expect(state,
           dspic33_device_advance(cpu, 40u) && cpu->io.dci.serial_bits == 1u &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "PMD holds physical CSDI shift state");
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state, dspic33_device_advance(cpu, 1u) && !cpu->io.dci.pmd_disabled,
           "PMD clear resumes physical CSDI sampler");
    for (bit = 1u; bit < 4u; bit++) {
        uint16_t high = bit == 2u ? GPIO_DATA_MASK : 0u;
        dspic33_gpio_drive(cpu, GPIO_PORT_D, high, GPIO_DATA_MASK);
        dspic33_device_advance(cpu, bit == 1u ? 3u : 4u);
    }
    expect(state,
           dspic33_device_advance(cpu, 4u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "resumed physical CSDI sampler completes retained word");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_internal(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_DATA_MASK, GPIO_DATA_MASK);
    expect(state, dspic33_device_advance(cpu, 12u),
           "advance internal CSDI sampler before copy");
    expect(state, dspic33_initialize(&copy), "initialize internal CSDI copy");
    expect(state, dspic33_copy(&copy, cpu), "copy active internal CSDI sampler");
    for (bit = 1u; bit < 4u; bit++) {
        dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_DATA_MASK);
        dspic33_gpio_drive(&copy, GPIO_PORT_D, GPIO_DATA_MASK, GPIO_DATA_MASK);
        dspic33_device_advance(cpu, 4u);
        dspic33_device_advance(&copy, 4u);
    }
    expect(state,
           dspic33_device_advance(cpu, 4u) && dspic33_device_advance(&copy, 4u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x8000u &&
               dspic33_read_word(&copy, DCI_RECEIVE_BASE) == 0xf000u,
           "copied CSDI samplers shift physical inputs independently");
    dspic33_destroy(&copy);
}

static void pps_selection_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t selection;
    bool high;
    for (selection = 0u; selection < 16u; selection++) {
        dspic33_reset(cpu, 0u);
        configure_serial_pins(cpu);
        dspic33_write_word(cpu, DCI_PPS_INPUTS,
                           (uint16_t)((selection << 8u) | PPS_DATA_PIN));
        configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
        expect(state,
               drive_serial_word(cpu, 0xf000u, 4u, true) && !cpu->io.dci.initialized,
               "DCI virtual and reserved clock selections remain inaccessible");

        dspic33_reset(cpu, 0u);
        configure_serial_pins(cpu);
        dspic33_write_word(cpu, DCI_PPS_INPUTS,
                           (uint16_t)((PPS_CLOCK_PIN << 8u) | selection));
        configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
        expect(state,
               drive_serial_word(cpu, 0xf000u, 4u, true) &&
                   dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
               "DCI virtual and reserved data selections resolve low");

        dspic33_reset(cpu, 0u);
        configure_serial_pins(cpu);
        dspic33_write_word(cpu, DCI_PPS_FRAME, selection);
        configure_external(cpu,
                           DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME | DCI_DATA_JUSTIFY,
                           4u, 1u, 1u, 0u, 1u);
        activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
        dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK);
        expect(state,
               drive_serial_word(cpu, 0xf000u, 4u, true) && cpu->io.dci.initialized &&
                   !cpu->io.dci.started &&
                   dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
               "DCI virtual and reserved frame selections remain inaccessible");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0xa000u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_DATA_JUSTIFY);
    dspic33_device_advance(cpu, 12u);
    for (selection = 0u; selection < 64u; selection++) {
        dspic33_write_word(cpu, DCI_PPS_DATA_OUTPUT,
                           (uint16_t)((uint16_t)selection << 8u));
        expect(state,
               dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high) ==
                   (selection >= 11u && selection <= 13u),
               "DCI RPOR function admission matches target table");
    }
}

static void pps_output_cases(DciConformance* state, Dspic33* cpu) {
    bool high;
    expect(state,
           !dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, NULL) &&
               !dspic33_dci_pin(cpu, 0u, &high),
           "DCI pin API rejects invalid queries");
    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_DATA_OUTPUT, 0x0b00u);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME, 4u, 1u, 1u, 1u, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0xa000u);
    activate_serial_clock(cpu, true, GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK);
    expect(state, drive_serial_edge(cpu, false, true, GPIO_CLOCK_MASK),
           "start PPS DCI data output frame");
    expect(state, dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high) && high,
           "CSDO RPOR mapping drives transmit MSb");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    expect(state, dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high) && high,
           "CSDO holds transmit MSb before first data sample");
    expect(state, drive_serial_bit(cpu, true, true), "sample first PPS DCI output bit");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    expect(state, dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high) && !high,
           "CSDO advances on opposite serial clock edge");
    dspic33_write_word(cpu, DCI_PPS_DATA_OUTPUT, 0x000bu);
    expect(state,
           !dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high) &&
               dspic33_dci_pin(cpu, PPS_FRAME_PIN, &high) && !high,
           "CSDO output follows live RPOR remapping");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_DATA_OUTPUT, 0x0b00u);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_TRISTATE, 4u, 1u, 1u, 0u, 0u);
    expect(state, drive_serial_bit(cpu, false, true), "start tri-stated PPS DCI slot");
    expect(state, !dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high),
           "CSDOM releases disabled CSDO slot");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d0cu);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0xa000u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_DATA_JUSTIFY);
    expect(state,
           dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && high &&
               dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
           "master DCI drives CSCK during startup with inactive COFS");
    expect(state, dspic33_device_advance(cpu, 12u),
           "advance master DCI through startup clocks");
    expect(state, dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) && high,
           "master DCI begins data word with asserted CSCK");
    expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
           "master multi-channel DCI asserts COFS for first clock");
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance master DCI beyond first serial clock");
    expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
           "master multi-channel DCI negates COFS after first clock");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_DATA_OUTPUT, 0x0b00u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0xa000u);
    dspic33_write_word(cpu, DCI_CONTROL1,
                       DCI_ENABLE | DCI_DATA_JUSTIFY | DCI_SAMPLE_RISING);
    expect(state, dspic33_device_advance(cpu, 12u),
           "advance rising-sample master through startup clocks");
    expect(state, dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high) && high,
           "rising-sample master presents first CSDO bit before rising edge");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance rising-sample master to falling edge");
    expect(state, dspic33_dci_pin(cpu, PPS_DATA_OUTPUT_PIN, &high) && !high,
           "rising-sample master advances CSDO on falling edge");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d0cu);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 8u),
           "advance default-justified master to final startup clock");
    expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
           "default DJST asserts COFS one clock before data");
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance default-justified master to data boundary");
    expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
           "default DJST negates COFS when first data bit begins");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d0cu);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_MODE_I2S | DCI_DATA_JUSTIFY);
    expect(state, dspic33_device_advance(cpu, 12u),
           "advance I2S master through startup clocks");
    expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && high,
           "I2S master drives right-channel COFS high first");
    expect(state, dspic33_device_advance(cpu, 16u),
           "advance I2S master through right-channel word");
    expect(state, dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high) && !high,
           "I2S master toggles COFS for left-channel word");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d0cu);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME, 4u, 1u, 1u, 0u, 0u);
    expect(state,
           !dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high) &&
               !dspic33_dci_pin(cpu, PPS_FRAME_OUTPUT_PIN, &high),
           "slave DCI releases externally directed CSCK and COFS outputs");
}

static void pps_disable_timing_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 0u);
    expect(state, drive_serial_bit(cpu, true, true) && cpu->io.dci.serial_bits == 1u,
           "advance PPS DCI to exact three-clock disable boundary");
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_SAMPLE_RISING | DCI_EXTERNAL_CLOCK);
    expect(state, cpu->io.dci.disable_pending && cpu->io.dci.disable_frames == 1u,
           "external DCI exact three-clock clear selects current frame");
    expect(state,
           drive_serial_bit(cpu, false, true) && drive_serial_bit(cpu, true, true) &&
               drive_serial_bit(cpu, false, true) && !cpu->io.dci.started &&
               !cpu->io.dci.initialized && !cpu->io.dci.disable_pending,
           "external DCI exact boundary stops at current frame end");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 0u);
    expect(state,
           drive_serial_bit(cpu, true, true) && drive_serial_bit(cpu, false, true) &&
               cpu->io.dci.serial_bits == 2u,
           "advance PPS DCI inside final three clocks");
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_SAMPLE_RISING | DCI_EXTERNAL_CLOCK);
    expect(state, cpu->io.dci.disable_pending && cpu->io.dci.disable_frames == 2u,
           "external DCI late clear selects following frame");
    expect(state,
           drive_serial_bit(cpu, true, true) && drive_serial_bit(cpu, false, true) &&
               cpu->io.dci.started && cpu->io.dci.disable_frames == 1u,
           "external DCI late clear completes current frame");
    expect(state,
           drive_serial_word(cpu, 0xa000u, 4u, true) && !cpu->io.dci.started &&
               !cpu->io.dci.initialized && !cpu->io.dci.disable_pending,
           "external DCI late clear stops after following frame");
}

static void pps_lifecycle_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool high;
    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 8u, 1u, 1u, 0u, 1u);
    expect(state,
           drive_serial_bit(cpu, true, true) && drive_serial_bit(cpu, false, true) &&
               drive_serial_bit(cpu, true, true) && cpu->io.dci.serial_bits == 3u,
           "advance PPS DCI before active copy");
    expect(state, dspic33_initialize(&copy) && dspic33_copy(&copy, cpu),
           "copy active PPS DCI shift state");
    expect(
        state,
        drive_serial_bit(cpu, false, true) && drive_serial_bit(cpu, false, true) &&
            drive_serial_bit(cpu, true, true) && drive_serial_bit(cpu, false, true) &&
            drive_serial_bit(cpu, true, true) && drive_serial_bit(&copy, false, true) &&
            drive_serial_bit(&copy, false, true) &&
            drive_serial_bit(&copy, true, true) &&
            drive_serial_bit(&copy, false, true) && drive_serial_bit(&copy, true, true),
        "complete original and copied PPS DCI shifts");
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa500u &&
               dspic33_read_word(&copy, DCI_RECEIVE_BASE) == 0xa500u,
           "copied PPS DCI shift completes independently");
    dspic33_destroy(&copy);

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    expect(state,
           drive_serial_bit(cpu, true, true) && drive_serial_bit(cpu, false, true) &&
               cpu->io.dci.serial_bits == 2u,
           "advance PPS DCI before PMD disable");
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.dci.pmd_disabled,
           "disable PPS DCI through delayed PMD transition");
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) && cpu->io.dci.serial_bits == 2u,
           "PPS DCI misses serial edges while PMD-disabled");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state, dspic33_device_advance(cpu, 1u) && !cpu->io.dci.pmd_disabled,
           "enable PPS DCI through delayed PMD transition");
    expect(state,
           drive_serial_bit(cpu, false, true) && drive_serial_bit(cpu, true, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x9000u,
           "PPS DCI resumes retained partial word after PMD");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 4u, 1u, 1u, 0u, 1u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           drive_serial_word(cpu, 0x6000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x6000u,
           "externally clocked PPS DCI continues in Sleep");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_STOP_IDLE, 4u, 1u, 1u, 0u, 1u);
    expect(state, drive_serial_bit(cpu, true, true),
           "advance PPS DCI before Idle stop");
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) && cpu->io.dci.serial_bits == 1u,
           "DCISIDL makes PPS DCI miss Idle serial edges");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_CLOCK_MASK);
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state,
           drive_serial_bit(cpu, false, true) && drive_serial_bit(cpu, true, true) &&
               drive_serial_bit(cpu, false, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "PPS DCI resumes retained partial word after Idle");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING, 8u, 1u, 1u, 0u, 1u);
    expect(state,
           drive_serial_bit(cpu, true, true) && drive_serial_bit(cpu, false, true) &&
               cpu->io.dci.serial_bits == 2u,
           "advance PPS DCI before warm reset");
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->io.dci.serial_bits == 0u &&
               dspic33_read_word(cpu, DCI_CONTROL1) == 0u &&
               dspic33_gpio_pin(cpu, GPIO_PORT_D, 1u, &high) && high,
           "warm reset clears PPS shift state and preserves physical levels");

