tylertms/dspic33e-sim/conformance/dci.c
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PPS_CLOCK_FRAME_OUTPUT, 0x0d0cu);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_DATA_JUSTIFY);
    expect(state,
           dspic33_device_advance(cpu, 5u) &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high),
           "advance master PPS output before PMD");
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.dci.pmd_disabled &&
               !dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high),
           "PMD releases DCI PPS outputs");
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.dci.pmd_disabled &&
               dspic33_dci_pin(cpu, PPS_CLOCK_OUTPUT_PIN, &high),
           "PMD clear restores retained DCI PPS output phase");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME | DCI_DATA_JUSTIFY,
                       4u, 1u, 1u, 0u, 1u);
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.dci.pmd_disabled,
           "disable framed PPS DCI through PMD");
    expect(state,
           dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK) &&
               !cpu->io.dci.pps_frame_pending,
           "PMD-disabled DCI misses COFS edge");
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               drive_serial_word(cpu, 0xf000u, 4u, true) && cpu->io.dci.initialized &&
               !cpu->io.dci.started && dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "PMD clear cannot replay missed COFS edge");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_FRAME_MASK | GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK);
    expect(state,
           drive_serial_word(cpu, 0xa000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "post-PMD COFS edge starts a new frame");

    dspic33_reset(cpu, 0u);
    configure_serial_pins(cpu);
    configure_external(
        cpu, DCI_SAMPLE_RISING | DCI_EXTERNAL_FRAME | DCI_DATA_JUSTIFY | DCI_STOP_IDLE,
        4u, 1u, 1u, 0u, 1u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state,
           dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK) &&
               !cpu->io.dci.pps_frame_pending,
           "DCISIDL makes DCI miss Idle COFS edge");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state,
           drive_serial_word(cpu, 0xf000u, 4u, true) && cpu->io.dci.initialized &&
               !cpu->io.dci.started && dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "Idle resume cannot replay missed COFS edge");
    dspic33_gpio_drive(cpu, GPIO_PORT_D, 0u, GPIO_FRAME_MASK | GPIO_CLOCK_MASK);
    dspic33_gpio_drive(cpu, GPIO_PORT_D, GPIO_FRAME_MASK, GPIO_FRAME_MASK);
    expect(state,
           drive_serial_word(cpu, 0x5000u, 4u, true) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5000u,
           "post-Idle COFS edge starts a new frame");
}

static void mode_and_status_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33DciTransfer transfer;
    uint8_t mode;
    for (mode = 0u; mode < 2u; mode++) {
        dspic33_reset(cpu, 0u);
        configure_external(cpu, mode != 0u ? DCI_UNDERFLOW_LAST : 0u, 16u, 1u, 1u, 1u,
                           0u);
        dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x5a5au);
        expect(state, clock_word(cpu, 0u, false), "clock initial underflow mode word");
        expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x5a5au,
               "initial TXBUF value reaches DCI output");
        expect(state, clock_word(cpu, 0u, false), "clock underflow replacement word");
        expect(state,
               dspic33_dci_transmit(cpu, &transfer) &&
                   transfer.value == (mode != 0u ? 0x5a5au : 0u),
               "UNFM selects last value or zero after underflow");
        expect(state,
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_UNDERFLOW) != 0u,
               "missing TXBUF sets TUNF");
        dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x6b6bu);
        expect(state,
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_UNDERFLOW) == 0u,
               "culprit TXBUF write clears TUNF");
    }

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_LOOPBACK, 16u, 1u, 1u, 1u, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1357u);
    expect(state, clock_word(cpu, 0x2468u, false), "clock loopback word");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x1357u,
           "DLOOP routes transmit shadow into receive buffer");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 2u, 1u, 1u, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x7777u);
    expect(state, clock_word(cpu, 0u, false), "clock driven active slot");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.driven,
           "enabled transmit slot drives output");
    expect(state, clock_word(cpu, 0u, false), "clock driven disabled slot");
    expect(state,
           dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0u &&
               transfer.driven,
           "CSDOM zero drives disabled slot low");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_TRISTATE, 16u, 2u, 1u, 1u, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x8888u);
    expect(state, clock_word(cpu, 0u, false), "clock tristate active slot");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.driven,
           "CSDOM one still drives enabled transmit slot");
    expect(state, clock_word(cpu, 0u, false), "clock tristate disabled slot");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && !transfer.driven,
           "CSDOM one tri-states disabled slot");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 1u, 2u, 0u, 1u);
    expect(state, clock_word(cpu, 0x1001u, false) && clock_word(cpu, 0x1002u, false),
           "fill two receive buffers");
    expect(state, cpu->io.dci.receive_unread == 0x03u,
           "RFUL tracks both unread RXBUFs");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x1001u,
           "read first RXBUF independently");
    expect(state,
           cpu->io.dci.receive_unread == 0x02u &&
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_FULL) != 0u,
           "RFUL remains until every active RXBUF is read");
    expect(state, clock_word(cpu, 0x2001u, false) && clock_word(cpu, 0x2002u, false),
           "overwrite partially unread receive block");
    expect(state, cpu->io.dci.receive_overflow == 0x02u,
           "ROV identifies only the unread overwritten RXBUF");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2001u,
           "nonculprit RXBUF read preserves ROV");
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_OVERFLOW) != 0u,
           "ROV persists until culprit RXBUF read");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x2002u,
           "read overflow culprit RXBUF");
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_OVERFLOW) == 0u,
           "culprit RXBUF read clears ROV");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 2u, 4u));
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 4u, 0x3333u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 0x0001u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 0x0003u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_EXTERNAL_CLOCK);
    expect(state, clock_word(cpu, 0u, false), "clock preloaded TXBUF0");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x1111u,
           "TXBUF preload before TSCON supplies active buffer zero");
    expect(state, clock_word(cpu, 0u, false) && clock_word(cpu, 0u, false),
           "advance mixed slots to preloaded TXBUF2");
    expect(state,
           dspic33_dci_transmit(cpu, &transfer) &&
               dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x3333u,
           "TXBUF preload before TSCON supplies active buffer two");
}

static void interrupt_dma_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    enable_interrupt(cpu, DCI_ERROR_IRQ, 4u);
    enable_interrupt(cpu, DCI_TRANSFER_IRQ, 3u);
    cpu->w[15] = 0x1800u;
    configure_external(cpu, 0u, 16u, 1u, 1u, 1u, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x3456u);
    expect(state, clock_word(cpu, 0x1234u, false), "clock IRQ fixture");
    expect(state, interrupt_set(cpu, DCI_TRANSFER_IRQ), "block transfer raises IRQ60");
    expect(state, interrupt_set(cpu, DCI_ERROR_IRQ), "TX underflow raises IRQ59");
    expect(state,
           dspic33_device_service_interrupt(cpu) &&
               cpu->last_interrupt == DCI_ERROR_IRQ,
           "higher-priority DCI error vectors first");
    expect(state, cpu->pc == DCI_VECTOR, "DCI error uses IRQ59 vector");
    clear_interrupt(cpu, DCI_ERROR_IRQ);

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x4000u, 0x7a5au);
    configure_dma(cpu, 1u, 0x2001u, 0x4000u, DCI_TRANSMIT_BASE, 0u, DCI_DMA_REQUEST);
    configure_external(cpu, 0u, 16u, 1u, 1u, 1u, 0u);
    expect(state, clock_word(cpu, 0u, false), "clock initial TX DMA block");
    expect(state, dspic33_device_advance(cpu, 2u), "complete DCI TX DMA transfer");
    expect(state, clock_word(cpu, 0u, false), "clock loaded TX DMA block");
    expect(state, cpu->io.dci.last_transmit[0] == 0x7a5au,
           "DCI TX DMA copies RAM to TXBUF0");

    dspic33_reset(cpu, 0u);
    configure_dma(cpu, 0u, 0x0001u, 0x4100u, DCI_RECEIVE_BASE, 0u, DCI_DMA_REQUEST);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0x6b4bu, false), "clock RX DMA block");
    expect(state, dspic33_device_advance(cpu, 2u), "complete DCI RX DMA transfer");
    expect(state, dspic33_read_word(cpu, 0x4100u) == 0x6b4bu,
           "DCI RX DMA copies RXBUF0 to RAM");

    dspic33_reset(cpu, 0u);
    configure_dma(cpu, 0u, 0x0001u, 0x4200u, DCI_RECEIVE_BASE, 0u, DCI_DMA_REQUEST);
    configure_external(cpu, 0u, 16u, 1u, 2u, 0u, 1u);
    expect(state, clock_word(cpu, 0x7777u, false) && dspic33_device_advance(cpu, 2u),
           "clock BLEN greater than zero fixture");
    expect(state, dspic33_read_word(cpu, 0x4200u) == 0u,
           "BLEN greater than zero suppresses undefined DMA request");

    dspic33_reset(cpu, 0u);
    configure_dma(cpu, 0u, 0x0001u, 0x4300u, DCI_RECEIVE_BASE, 0u, 0x3bu);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0x8888u, false) && dspic33_device_advance(cpu, 2u),
           "clock wrong IRQSEL fixture");
    expect(state, dspic33_read_word(cpu, 0x4300u) == 0u,
           "wrong IRQSEL receives no DCI DMA request");

    dspic33_reset(cpu, 0u);
    enable_interrupt(cpu, DCI_TRANSFER_IRQ, 3u);
    cpu->w[15] = 0x1800u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0xcccdu, false), "clock sleeping DCI fixture");
    expect(state, interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "sleeping external DCI sets IRQ60");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance sleeping DCI interrupt eligibility");
    expect(state,
           dspic33_device_wake(cpu) && cpu->last_interrupt == DCI_TRANSFER_IRQ &&
               cpu->pc == DCI_VECTOR,
           "external DCI wakes from Sleep through IRQ60 vector");

    dspic33_reset(cpu, 0u);
    enable_interrupt(cpu, DCI_TRANSFER_IRQ, 2u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0xdedeu, false), "clock equal-priority DCI fixture");
    expect(state,
           dspic33_device_wake(cpu) && cpu->interrupt_count == 0u &&
               interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "equal-priority DCI wakes without vector and retains IRQ60");
}

static void generation_and_frame_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 1u), "advance before stale DCI start");
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state,
           dspic33_device_advance(cpu, 11u) && cpu->io.dci.internal_scheduled &&
               !cpu->io.dci.initialized,
           "stale start event cannot clear current scheduling latch");
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.dci.initialized,
           "current generation start event initializes DCI");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_EXTERNAL_FRAME);
    expect(state, clock_word(cpu, 0x1111u, true),
           "external FS before internal startup is accepted as physical input");
    expect(state,
           dspic33_device_advance(cpu, 96u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "pre-start and absent FS cannot arm internal-frame transfer");
    expect(state, clock_word(cpu, 0x2222u, true),
           "external FS arms initialized internal-frame transfer");
    expect(state,
           dspic33_device_advance(cpu, 63u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "internal-frame word remains pending before full interval");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2222u,
           "internal-frame word completes after external FS");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.dci.pmd_disabled &&
               cpu->io.dci.pmd_generation == 2u,
           "rapid PMD toggle rejects stale disabled generation");
}

static void disable_timing_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33DciTransfer transfer;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 12u) && cpu->io.dci.initialized,
           "initialize one-slot DCI frame");
    expect(state, dspic33_device_advance(cpu, 32u),
           "advance within active DCI slot zero");
    dspic33_dci_input(cpu, 0x2222u);
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    expect(state,
           cpu->io.dci.started && cpu->io.dci.disable_pending &&
               cpu->io.dci.disable_frames == 1u && cpu->events.count == 1u,
           "slot-zero disable retains current one-slot frame");
    expect(state, dspic33_device_advance(cpu, 31u) && cpu->io.dci.started,
           "slot-zero disable waits through active word");
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.dci.started &&
               !cpu->io.dci.disable_pending &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2222u &&
               dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x1111u,
           "slot-zero disable completes current frame before stopping");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 64u),
           "advance to three-clock DCI disable boundary");
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    expect(state, cpu->io.dci.disable_pending && cpu->io.dci.disable_frames == 1u,
           "three-clock DCI disable selects current frame");
    expect(state,
           dspic33_device_advance(cpu, 12u) && !cpu->io.dci.started &&
               !cpu->io.dci.disable_pending,
           "three-clock DCI disable stops at current frame end");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x3333u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 65u),
           "advance inside final three DCI clocks");
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    expect(state, cpu->io.dci.disable_pending && cpu->io.dci.disable_frames == 2u,
           "late DCI disable selects following frame");
    expect(state,
           dspic33_device_advance(cpu, 11u) && cpu->io.dci.started &&
               cpu->io.dci.disable_pending && cpu->io.dci.disable_frames == 1u &&
               dspic33_dci_transmit(cpu, &transfer) && transfer.slot == 0u,
           "late DCI disable completes current frame and continues");
    expect(state, dspic33_device_advance(cpu, 63u) && cpu->io.dci.started,
           "late DCI disable waits through following frame");
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.dci.started &&
               !cpu->io.dci.disable_pending && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 0u,
           "late DCI disable stops after following frame");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 2u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 3u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 12u), "initialize two-slot DCI frame");
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    expect(state, cpu->io.dci.disable_pending && cpu->io.dci.disable_frames == 1u,
           "early slot-zero disable retains multi-slot frame");
    expect(state,
           dspic33_device_advance(cpu, 16u) && cpu->io.dci.started &&
               cpu->io.dci.slot == 1u,
           "multi-slot disable continues after slot zero");
    expect(state,
           dspic33_device_advance(cpu, 16u) && !cpu->io.dci.started &&
               !cpu->io.dci.disable_pending,
           "multi-slot disable stops at frame end");
}

static void internal_clock_lifecycle_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 5u), "advance DCI startup before PMD");
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.dci.pmd_disabled &&
               cpu->events.count == 1u && cpu->events.items[0].paused &&
               cpu->events.items[0].paused_remaining == 6u,
           "PMD retains remaining DCI startup phase");
    expect(state, dspic33_device_advance(cpu, 40u) && !cpu->io.dci.initialized,
           "PMD holds DCI startup indefinitely");
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.dci.pmd_disabled &&
               !cpu->events.items[0].paused,
           "PMD enable resumes retained DCI startup phase");
    expect(state, dspic33_device_advance(cpu, 5u) && !cpu->io.dci.initialized,
           "resumed DCI startup waits to retained boundary");
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.dci.initialized,
           "resumed DCI startup completes at retained boundary");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 17u), "advance DCI into internal word");
    dspic33_dci_input(cpu, 0xa000u);
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    expect(state,
           cpu->events.count == 1u && cpu->events.items[0].paused &&
               cpu->events.items[0].paused_remaining == 11u,
           "BCG zero retains remaining DCI word phase");
    expect(state,
           dspic33_device_advance(cpu, 50u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "BCG zero holds DCI word indefinitely");
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    expect(state,
           dspic33_device_advance(cpu, 10u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "restored BCG waits to retained word boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "restored BCG completes at retained word boundary");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 17u), "advance DCI before stepped Sleep");
    dspic33_dci_input(cpu, 0xb000u);
    expect(state, dspic33_load_program_word(cpu, 0x0200u, OPCODE_SLEEP),
           "load DCI Sleep instruction");
    cpu->pc = 0x0200u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_SLEEPING && cpu->events.items[0].paused &&
               cpu->events.items[0].paused_remaining == 11u,
           "PWRSAV Sleep retains remaining DCI word phase");
    expect(state,
           dspic33_device_advance(cpu, 50u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "Sleep holds internal DCI word indefinitely");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    dspic33_device_power_state_changed(cpu);
    expect(state,
           dspic33_device_advance(cpu, 10u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "DCI Sleep wake waits to retained word boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xb000u,
           "DCI Sleep wake completes at retained word boundary");

