tylertms/dspic33e-sim/conformance/dci.c
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_STOP_IDLE);
    expect(state, dspic33_device_advance(cpu, 17u),
           "advance DCI before stepped stopped Idle");
    dspic33_dci_input(cpu, 0xc000u);
    expect(state, dspic33_load_program_word(cpu, 0x0200u, OPCODE_IDLE),
           "load stopped DCI Idle instruction");
    cpu->pc = 0x0200u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_IDLING && cpu->events.items[0].paused &&
               cpu->events.items[0].paused_remaining == 11u,
           "DCISIDL retains remaining DCI word phase");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    dspic33_device_power_state_changed(cpu);
    expect(state,
           dspic33_device_advance(cpu, 11u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xc000u,
           "DCISIDL wake completes retained DCI word");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 17u),
           "advance DCI before continuing Idle");
    dspic33_dci_input(cpu, 0xd000u);
    expect(state, dspic33_load_program_word(cpu, 0x0200u, OPCODE_IDLE),
           "load continuing DCI Idle instruction");
    cpu->pc = 0x0200u;
    expect(state, dspic33_step(cpu) == DSPIC33_IDLING && !cpu->events.items[0].paused,
           "DCISIDL clear keeps internal DCI clock running in Idle");
    expect(state,
           dspic33_device_advance(cpu, 10u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xd000u,
           "continuing Idle reaches original DCI word boundary");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 17u),
           "advance DCI before paused disable");
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    expect(state,
           cpu->events.count == 1u && cpu->events.items[0].paused &&
               cpu->io.dci.disable_pending && cpu->io.dci.started,
           "DCI disable retains paused active frame");
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    expect(state,
           dspic33_device_advance(cpu, 11u) && !cpu->io.dci.started &&
               !cpu->io.dci.disable_pending && cpu->events.count == 0u,
           "restored DCI clock completes pending disabled frame");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 5u),
           "advance DCI before resume overflow");
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    cpu->device_cycles = UINT64_MAX - 5u;
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR && cpu->events.items[0].paused,
           "DCI resume overflow leaves retained event paused");
    cpu->stop_reason = DSPIC33_RUNNING;
}

static void lifecycle_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    Dspic33DciTransfer transfer;
    bool initialized;
    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 2u, 1u, 1u, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1234u);
    expect(state, clock_word(cpu, 0x5678u, false), "capture before DCI disable");
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_EXTERNAL_CLOCK);
    expect(state, cpu->io.dci.disable_pending, "DCIEN clear defers through frame end");
    expect(state, clock_word(cpu, 0x9abcu, false), "finish disabled DCI frame");
    expect(state, !cpu->io.dci.disable_pending,
           "DCIEN clear completes deferred disable at frame end");
    expect(state, !cpu->io.dci.started, "DCIEN clear stops engine after current frame");
    expect(state, (dspic33_read_word(cpu, DCI_CONTROL1) & DCI_ENABLE) == 0u,
           "DCIEN remains clear after frame completion");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    dspic33_dci_input(cpu, 0x4a4au);
    expect(state, clock_word(cpu, 0x5b5bu, false), "capture warm-reset RXBUF");
    dspic33_dci_input(cpu, 0x4a4au);
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "execute DCI warm reset");
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5b5bu &&
               cpu->io.dci.input == 0x4a4au &&
               dspic33_read_word(cpu, DCI_CONTROL1) == 0u,
           "warm reset preserves RXBUF and physical input but resets DCI engine");
    dspic33_reset(cpu, 0u);
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u && cpu->io.dci.input == 0u,
           "POR clears deterministic RXBUF and physical input state");

    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize DCI copy destination");
    if (initialized) {
        dspic33_reset(cpu, 0u);
        configure_external(cpu, 0u, 16u, 1u, 1u, 1u, 1u);
        dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x2468u);
        expect(state,
               dspic33_dci_clock(cpu, 0x1357u, false, 2u) && dspic33_copy(&copy, cpu),
               "copy DCI state with pending clock event");
        expect(state,
               dspic33_device_advance(&copy, 2u) &&
                   dspic33_dci_transmit(&copy, &transfer) &&
                   transfer.value == 0x2468u &&
                   dspic33_read_word(&copy, DCI_RECEIVE_BASE) == 0x1357u &&
                   cpu->events.count == 1u,
               "copied DCI event executes independently");
        dspic33_destroy(&copy);
    }

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    cpu->io.dci.output.count = DSPIC33_DCI_QUEUE_SIZE;
    expect(state, !clock_word(cpu, 0xaaaau, false), "clock full output queue");
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               (dspic33_read_word(cpu, DCI_CONTROL1) & DCI_ENABLE) == 0u,
           "output queue overflow deterministically aborts DCI");
    cpu->stop_reason = DSPIC33_RUNNING;

    dspic33_reset(cpu, 0u);
    {
        uint64_t cycles = cpu->device_cycles;
        size_t queued = cpu->events.count;
        cpu->device_cycles = UINT64_MAX;
        expect(state,
               !dspic33_dci_clock(cpu, 0x1234u, false, 1u) &&
                   cpu->events.count == queued,
               "DCI clock scheduling failure queues no partial event");
        cpu->device_cycles = cycles;
    }

    dspic33_reset(cpu, 0u);
    {
        uint64_t cycles = cpu->device_cycles;
        cpu->device_cycles = UINT64_MAX;
        dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
        dspic33_write_word(cpu, DCI_CONTROL3, 1u);
        dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
        dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
        expect(state,
               cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
                   (dspic33_read_word(cpu, DCI_CONTROL1) & DCI_ENABLE) == 0u &&
                   cpu->events.count == 0u,
               "internal start schedule failure aborts DCI without stale event");
        cpu->device_cycles = cycles;
        cpu->stop_reason = DSPIC33_RUNNING;
    }

    dspic33_reset(cpu, 0u);
    {
        uint64_t cycles = cpu->device_cycles;
        uint16_t generation = cpu->io.dci.pmd_generation;
        cpu->device_cycles = UINT64_MAX;
        dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
        expect(state,
               dspic33_read_word(cpu, DCI_PMD) == 0u &&
                   cpu->io.dci.pmd_generation == (uint16_t)(generation + 2u) &&
                   !cpu->io.dci.pmd_disabled && cpu->events.count == 0u &&
                   cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
               "DCI PMD schedule failure rolls back and invalidates transition");
        cpu->device_cycles = cycles;
        cpu->stop_reason = DSPIC33_RUNNING;
    }
}

int main(void) {
    Dspic33 cpu;
    DciConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize DCI processor");
    if (initialized) {
        access_cases(&state, &cpu);
        width_and_lane_cases(&state, &cpu);
        slot_buffer_status_cases(&state, &cpu);
        admission_and_clock_cases(&state, &cpu);
        protocol_geometry_cases(&state, &cpu);
        protocol_frame_cases(&state, &cpu);
        ac_link_cases(&state, &cpu);
        protocol_integration_cases(&state, &cpu);
        pps_serial_input_cases(&state, &cpu);
        pps_frame_cases(&state, &cpu);
        pps_serial_matrix_cases(&state, &cpu);
        pps_startup_cases(&state, &cpu);
        pps_internal_input_cases(&state, &cpu);
        pps_internal_frame_cases(&state, &cpu);
        pps_external_frame_output_cases(&state, &cpu);
        pps_internal_frame_output_cases(&state, &cpu);
        pps_bcg_cases(&state, &cpu);
        pps_internal_sample_lifecycle_cases(&state, &cpu);
        pps_selection_cases(&state, &cpu);
        pps_qualification_cases(&state, &cpu);
        pps_output_cases(&state, &cpu);
        pps_disable_timing_cases(&state, &cpu);
        pps_lifecycle_cases(&state, &cpu);
        mode_and_status_cases(&state, &cpu);
        interrupt_dma_cases(&state, &cpu);
        generation_and_frame_cases(&state, &cpu);
        disable_timing_cases(&state, &cpu);
        internal_clock_lifecycle_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        expect(&state, state.cases == 14217u, "DCI assertion accounting");
        dspic33_destroy(&cpu);
    }
    printf("[dci-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
